Revit 2025 API
RoundingMethod Enumeration
 Rounding methods
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RoundingMethod
Public Enumeration RoundingMethod
public enum class RoundingMethod
type RoundingMethod
Members
Member name | Value | Description
Nearest | 0 |  Standard rounding: Round to Nearest
Up | 1 |  Round Up
Down | 2 |  Round Down
See Also
Reference
Autodesk.Revit.DB Namespace